Repository: bosxixi/OriginScan
Catalog: OriginScan/Resources/*.lproj/Localizable.strings
Languages: bn, hi, ko, pa, th, zh_hant

source: Origin Scan
hi: मूल स्कैन
ko: 원산지 스캔
th: สแกนแหล่งกำเนิด
zh_hant: 產地掃描

source: Enter barcode manually
hi: बारकोड मैन्युअल रूप से दर्ज करें
ko: 바코드를 수동으로 입력하세요
th: ป้อนบาร์โค้ดด้วยตนเอง
zh_hant: 手動輸入條形碼

source: Scan
hi: स्कैन
ko: 스캔
th: สแกน
zh_hant: 掃描

source: Search
hi: खोज
ko: 검색
th: ค้นหา
zh_hant: 搜索

source: Position barcode within frame
hi: बारकोड को फ्रेम के अंदर रखें
ko: 바코드를 프레임 안에 위치시키세요
th: วางบาร์โค้ดภายในกรอบ
zh_hant: 將條形碼對準框內

source: History
bn: ইতিহাস
hi: इतिहास
ko: 기록
pa: ਇਤਿਹਾਸ
th: ประวัติ
zh_hant: 歷史

source: Settings
bn: সেটিংস
hi: सेटिंग्स
ko: 설정
pa: ਸੈਟਿੰਗਾਂ
th: ตั้งค่า
zh_hant: 設置

source: Close
bn: বন্ধ করুন
hi: बंद करें
ko: 닫기
pa: ਬੰਦ ਕਰੋ
th: ปิด
zh_hant: 關閉

source: Scans Remaining
bn: অবশিষ্ট স্ক্যান
hi: शेष स्कैन
ko: 남은 스캔 횟수
pa: ਬਾਕੀ ਸਕੈਨ
th: จำนวนการสแกนที่เหลือ
zh_hant: 剩餘掃描次數

source: Auto Search After Scan
hi: स्कैन के बाद स्वचालित खोज
ko: 스캔 후 자동 검색
th: ค้นหาอัตโนมัติหลังการสแกน
zh_hant: 掃描後自動搜索

# autoSearchAfterScanDescription
source: When enabled, the app will automatically search for the country of origin after scanning a barcode.
hi: सक्षम होने पर, ऐप बारकोड स्कैन करने के बाद मूल देश को स्वचालित रूप से खोजेगा।
ko: 활성화하면 바코드를 스캔한 후 원산지를 자동으로 검색합니다.
th: เมื่อเปิดใช้งาน แอปจะค้นหาประเทศต้นทางโดยอัตโนมัติหลังจากสแกนบาร์โค้ด
zh_hant: 啟用後，應用將在掃描條形碼後自動搜索原產國。

source: Scan History
bn: স্ক্যান ইতিহাস
hi: स्कैन इतिहास
ko: 스캔 기록
pa: ਸਕੈਨ ਇਤਿਹਾਸ
th: ประวัติการสแกน
zh_hant: 掃描歷史

source: Quick Scan
bn: দ্রুত স্ক্যান
hi: त्वरित स्कैन
ko: 빠른 스캔
pa: ਤੇਜ਼ ਸਕੈਨ
th: สแกนด่วน
zh_hant: 快速掃描

# quickScanDescription
source: When enabled, the app will automatically open the scanner after launch.
bn: সক্রিয় থাকলে, অ্যাপটি চালু হওয়ার পর স্বয়ংক্রিয়ভাবে স্ক্যানার খুলবে।
hi: सक्षम होने पर, ऐप लॉन्च होने के बाद स्वचालित रूप से स्कैनर खोलेगा।
ko: 활성화하면 앱이 시작된 후 자동으로 스캐너가 열립니다.
pa: ਜਦੋਂ ਸਮਰੱਥ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, ਐਪ ਸ਼ੁਰੂ ਹੋਣ ਤੋਂ ਬਾਅਦ ਸਕੈਨਰ ਨੂੰ ਆਟੋਮੈਟਿਕ ਤੌਰ ਤੇ ਖੋਲ੍ਹੇਗੀ।
th: เมื่อเปิดใช้งาน แอปจะเปิดเครื่องสแกนโดยอัตโนมัติหลังจากเริ่มต้น
zh_hant: 啟用後，應用將在啟動後自動打開掃描器。

source: About
bn: সম্পর্কে
hi: जानकारी
ko: 앱 정보
pa: ਬਾਰੇ
th: เกี่ยวกับ
zh_hant: 關於

# aboutText
source: OriginScan is an app that allows you to scan barcodes and discover the country of origin of products. Simply point your camera at a barcode or enter it manually to get instant information about the product's origin.
bn: OriginScan একটি অ্যাপ যা আপনাকে বারকোড স্ক্যান করতে এবং পণ্যগুলির উৎপত্তির দেশ আবিষ্কার করতে দেয়। কেবল আপনার ক্যামেরাটি একটি বারকোডের দিকে নির্দেশ করুন বা ম্যানুয়ালি প্রবেশ করান এবং পণ্যের উৎপত্তি সম্পর্কে তাত্ক্ষণিক তথ্য পান।
hi: OriginScan एक ऐप है जो आपको बारकोड स्कैन करने और उत्पादों के मूल देश का पता लगाने की अनुमति देता है। बस अपने कैमरे को बारकोड पर इंगित करें या मैन्युअल रूप से दर्ज करें और उत्पाद की उत्पत्ति के बारे में तुरंत जानकारी प्राप्त करें।
ko: OriginScan은 바코드를 스캔하여 제품의 원산지를 확인할 수 있는 앱입니다. 카메라를 바코드에 대거나 수동으로 입력하기만 하면 제품의 원산지에 대한 즉각적인 정보를 얻을 수 있습니다.
pa: OriginScan ਇੱਕ ਐਪ ਹੈ ਜੋ ਤੁਹਾਨੂੰ ਬਾਰਕੋਡ ਸਕੈਨ ਕਰਨ ਅਤੇ ਉਤਪਾਦਾਂ ਦੇ ਮੂਲ ਦੇਸ਼ ਦੀ ਖੋਜ ਕਰਨ ਦੀ ਆਗਿਆ ਦਿੰਦੀ ਹੈ। ਬਸ ਆਪਣੇ ਕੈਮਰੇ ਨੂੰ ਬਾਰਕੋਡ ਵੱਲ ਇਸ਼ਾਰਾ ਕਰੋ ਜਾਂ ਮੈਨੂਅਲੀ ਦਾਖਲ ਕਰੋ ਅਤੇ ਉਤਪਾਦ ਦੀ ਉਤਪਤੀ ਬਾਰੇ ਤੁਰੰਤ ਜਾਣਕਾਰੀ ਪ੍ਰਾਪਤ ਕਰੋ।
th: OriginScan เป็นแอปพลิเคชันที่ช่วยให้คุณสแกนบาร์โค้ดและค้นพบประเทศต้นทางของผลิตภัณฑ์ เพียงชี้กล้องไปที่บาร์โค้ดหรือป้อนด้วยตนเองเพื่อรับข้อมูลทันทีเกี่ยวกับแหล่งที่มาของผลิตภัณฑ์
zh_hant: OriginScan是一款可以掃描條形碼並發現產品原產地的應用程序。只需將相機對準條形碼或手動輸入，即可立即獲取有關產品原產地的信息。

source: Device Code
bn: ডিভাইস কোড
hi: डिवाइस कोड
ko: 기기 코드
pa: ਡਿਵਾਈਸ ਕੋਡ
th: รหัสอุปกรณ์
zh_hant: 設備代碼

source: Upgrade to Premium
bn: প্রিমিয়ামে আপগ্রেড করুন
hi: प्रीमियम में अपग्रेड करें
ko: 프리미엄으로 업그레이드
pa: ਪ੍ਰੀਮੀਅਮ ਵਿੱਚ ਅਪਗ੍ਰੇਡ ਕਰੋ
th: อัพเกรดเป็นพรีเมียม
zh_hant: 升級至進階版

# getAdditionalScans
source: Get 100 additional scans for just $2.99
bn: ₹249-এ 100টি অতিরিক্ত স্ক্যান পান
hi: ₹249 में 100 अतिरिक्त स्कैन प्राप्त करें
ko: ₩3,900에 100회 추가 스캔 획득
pa: ₹249 ਵਿੱਚ 100 ਵਾਧੂ ਸਕੈਨ ਪ੍ਰਾਪਤ ਕਰੋ
th: รับการสแกนเพิ่มเติม 100 ครั้งในราคา ฿99
zh_hant: 僅需NT$60即可獲得100次額外掃描

# purchaseScans
source: Purchase 100 Scans
bn: 100টি স্ক্যান কিনুন
hi: 100 स्कैन खरीदें
ko: 100회 스캔 구매
pa: 100 ਸਕੈਨ ਖਰੀਦੋ
th: ซื้อการสแกน 100 ครั้ง
zh_hant: 購買100次掃描

source: Maybe Later
bn: পরে
hi: बाद में
ko: 나중에
pa: ਬਾਅਦ ਵਿੱਚ
th: ไว้ก่อน
zh_hant: 稍後再說

source: Clear
bn: মুছুন
ko: 지우기
th: ล้าง
zh_hant: 清除

source: Clear History
bn: ইতিহাস মুছুন
ko: 스캔 기록 지우기
th: ล้างประวัติ
zh_hant: 清除歷史記錄

# clearHistoryConfirmation
source: Are you sure you want to clear all scan history? This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি সমস্ত স্ক্যান ইতিহাস মুছে ফেলতে চান? এই ক্রিয়াটি পূর্বাবস্থায় ফেরানো যাবে না।
ko: 모든 스캔 기록을 지우시겠습니까? 이 작업은 취소할 수 없습니다.
th: คุณแน่ใจหรือไม่ว่าต้องการล้างประวัติการสแกนทั้งหมด? การกระทำนี้ไม่สามารถย้อนกลับได้
zh_hant: 確定要清除所有掃描歷史記錄嗎？此操作無法撤銷。

source: Cancel
bn: বাতিল করুন
ko: 취소
th: ยกเลิก
zh_hant: 取消

source: Country Settings
ko: 국가 설정
th: ตั้งค่าประเทศ
zh_hant: 國家設置

source: Supported Countries
ko: 지원 국가
th: ประเทศที่รองรับ
zh_hant: 支持的國家

source: Boycotted Countries
ko: 보이콧 국가
th: ประเทศที่คว่ำบาตร
zh_hant: 抵制的國家

source: Search Countries
ko: 국가 검색
th: ค้นหาประเทศ
zh_hant: 搜索國家

# errorInvalidURL
source: Invalid URL
ko: 잘못된 URL
th: URL ไม่ถูกต้อง
zh_hant: 無效的URL

# errorInvalidResponse
source: Invalid response from server
ko: 서버로부터 잘못된 응답
th: การตอบสนองไม่ถูกต้องจากเซิร์ฟเวอร์
zh_hant: 伺服器響應無效

# errorInvalidData
source: Invalid data received
ko: 잘못된 데이터 수신
th: ได้รับข้อมูลไม่ถูกต้อง
zh_hant: 接收到的數據無效

# errorCountryNotFound
source: Country not found
ko: 국가를 찾을 수 없음
th: ไม่พบประเทศ
zh_hant: 未找到國家

# errorCountryNotSupported
source: This country is not in your supported countries list
ko: 이 국가는 지원 국가 목록에 없습니다
th: ประเทศนี้ไม่อยู่ในรายการประเทศที่รองรับของคุณ
zh_hant: 該國家不在您的支持國家列表中

# errorCountryBoycotted
source: This country is in your boycotted countries list
ko: 이 국가는 보이콧 국가 목록에 있습니다
th: ประเทศนี้อยู่ในรายการประเทศที่คว่ำบาตรของคุณ
zh_hant: 該國家在您的抵制國家列表中

source: Privacy Policy
ko: 개인정보 처리방침
th: นโยบายความเป็นส่วนตัว
zh_hant: 隱私政策

source: Contact Us
ko: 문의하기
th: ติดต่อเรา
zh_hant: 聯絡我們

# scanTipTapToFocus
source: Tap the screen to focus if scanning is slow
ko: 스캔이 느릴 경우 화면을 탭하여 초점을 맞추세요
th: หากการสแกนช้า ให้แตะหน้าจอเพื่อโฟกัส
zh_hant: 若掃描緩慢，請點擊螢幕對焦

source: Purchase More Scans
th: ซื้อการสแกนเพิ่มเติม
